{
  "data": [
    {
      "id": 1,
      "title": "Getting Started with React and TypeScript",
      "content": "React and TypeScript make a powerful combination for building robust web applications. In this comprehensive guide, we'll explore how to set up a new React project with TypeScript, configure your development environment, and implement best practices for type safety. We'll cover component typing, prop interfaces, state management, and common patterns that will help you build maintainable applications. Whether you're new to TypeScript or looking to improve your React development workflow, this guide will provide you with the foundation you need to succeed.",
      "author": "Sarah Johnson",
      "categories": ["React", "TypeScript", "Frontend"],
      "featuredImage": "/images/blog/react-typescript.jpg",
      "publishedAt": "2024-01-15T10:00:00Z"
    },
    {
      "id": 2,
      "title": "Building Scalable APIs with Node.js and Express",
      "content": "Creating scalable and maintainable APIs is crucial for modern web applications. This article explores best practices for building robust APIs using Node.js and Express. We'll discuss project structure, middleware implementation, error handling, authentication, and database integration. Learn how to implement proper logging, validation, and testing strategies that will help your API scale as your application grows. We'll also cover performance optimization techniques and security considerations that every backend developer should know.",
      "author": "Michael Chen",
      "categories": ["Node.js", "Backend", "API"],
      "featuredImage": "/images/blog/nodejs-api.jpg",
      "publishedAt": "2024-01-10T14:30:00Z"
    },
    {
      "id": 3,
      "title": "Modern CSS Techniques for Responsive Design",
      "content": "Responsive design has evolved significantly with modern CSS features. This post explores the latest techniques including CSS Grid, Flexbox, Container Queries, and CSS Custom Properties. We'll build practical examples that demonstrate how to create layouts that work seamlessly across all device sizes. Learn about mobile-first design principles, progressive enhancement, and how to optimize your CSS for performance. We'll also cover accessibility considerations and how to ensure your responsive designs work for all users.",
      "author": "Emily Rodriguez",
      "categories": ["CSS", "Design", "Frontend"],
      "featuredImage": "/images/blog/responsive-css.jpg",
      "publishedAt": "2024-01-05T09:15:00Z"
    },
    {
      "id": 4,
      "title": "Database Design Patterns for Web Applications",
      "content": "Effective database design is the foundation of any successful web application. This comprehensive guide covers essential database design patterns, normalization techniques, and performance optimization strategies. We'll explore different database types (SQL vs NoSQL), when to use each, and how to design schemas that scale. Learn about indexing strategies, query optimization, and how to handle relationships between data entities. We'll also discuss backup strategies, security considerations, and migration patterns for evolving your database schema over time.",
      "author": "David Kim",
      "categories": ["Database", "Backend", "Architecture"],
      "featuredImage": "/images/blog/database-design.jpg",
      "publishedAt": "2023-12-28T16:45:00Z"
    },
    {
      "id": 5,
      "title": "Introduction to Machine Learning for Web Developers",
      "content": "Machine learning is becoming increasingly accessible to web developers. This beginner-friendly introduction covers the fundamentals of ML concepts, popular libraries and frameworks, and practical applications in web development. We'll explore how to integrate ML models into web applications, discuss client-side vs server-side inference, and build a simple recommendation system. Learn about data preprocessing, model training basics, and how to evaluate model performance. This guide will help you understand when and how to incorporate machine learning into your web projects.",
      "author": "Lisa Wang",
      "categories": ["Machine Learning", "JavaScript", "AI"],
      "featuredImage": "/images/blog/ml-web-dev.jpg",
      "publishedAt": "2023-12-20T11:20:00Z"
    },
    {
      "id": 6,
      "title": "DevOps Best Practices for Small Teams",
      "content": "DevOps practices can significantly improve development workflows, even for small teams. This article outlines practical DevOps strategies that don't require large infrastructure investments. We'll cover continuous integration and deployment (CI/CD), containerization with Docker, infrastructure as code, and monitoring strategies. Learn how to set up automated testing pipelines, implement proper logging and alerting, and create deployment strategies that minimize downtime. We'll also discuss team collaboration tools and practices that help bridge the gap between development and operations.",
      "author": "Alex Thompson",
      "categories": ["DevOps", "CI/CD", "Infrastructure"],
      "featuredImage": "/images/blog/devops-practices.jpg",
      "publishedAt": "2023-12-15T13:10:00Z"
    }
  ],
  "meta": {
    "pagination": {
      "total": 6,
      "page": 1,
      "pageSize": 10
    }
  }
}